app/controllers/manage/addresses_controller.rb

SELECT  "addresses".* FROM "addresses" ORDER BY "addresses"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_address
      @address = Address.first