app/controllers/manage/brands_controller.rb

INSERT INTO "brands" ("content", "created_at", "updated_at") VALUES (?, ?, ?)
---
  def create
    @brand = Brand.new(brand_params)
    if @brand.save

UPDATE "brands" SET "content" = ?, "updated_at" = ? WHERE "brands"."id" = ?
---
  def update
    if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" ORDER BY "brands"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_brand
      @brand = Brand.first