app/controllers/manage/carsousels_controller.rb

  def index
    @carsousels = Carsousel.all
---
SELECT "carsousels".* FROM "carsousels"

  def create
    @carsousel = Carsousel.new(carsousel_params)
    if @carsousel.save
---
INSERT INTO "carsousels" ("no", "file", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["no", 1], ["file", "#<ActionDispatch::Http::UploadedFile:0x007f4ad0a0ca68>"], ["created_at", "2017-11-11 23:02:53.206967"], ["updated_at", "2017-11-11 23:02:53.206967"]]

  def edit
    @carsousel = Carsousel.find(params[:id])
---
SELECT  "carsousels".* FROM "carsousels" WHERE "carsousels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @carsousel = Carsousel.find(params[:id])
    if @carsousel.update(carsousel_params)
---
SELECT  "carsousels".* FROM "carsousels" WHERE "carsousels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carsousels" SET "file" = ?, "updated_at" = ? WHERE "carsousels"."id" = ?  [["file", "16.png"], ["updated_at", "2017-11-11 23:05:01.652806"], ["id", 1]]

  def destroy
    @carsousel = Carsousel.find(params[:id])
    @carsousel.destroy
---
SELECT  "carsousels".* FROM "carsousels" WHERE "carsousels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "carsousels" WHERE "carsousels"."id" = ?  [["id", 1]]