app/controllers/manage/clients_controller.rb

INSERT INTO "clients" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "11"], ["content", "111"], ["created_at", "2017-11-05 22:35:46.365259"], ["updated_at", "2017-11-05 22:35:46.365259"]]
---
  def create
    @client = Client.new(client_params)
    if @client.save

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clients" SET "content" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["content", "qqssss"], ["updated_at", "2017-11-11 22:23:30.950127"], ["id", 1]]
---
  def update
    @client = Client.find(params[:id])
    if @client.update(client_params)