app/controllers/manage/companies_controller.rb

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "cc"], ["created_at", "2017-10-28 22:03:55.882856"], ["updated_at", "2017-10-28 22:03:55.882856"]]

    def set_company
      @company = Company.first
---
SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]