app/controllers/manage/contacts_controller.rb

INSERT INTO "contacts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "dddd"], ["created_at", "2017-10-27 21:18:56.314520"], ["updated_at", "2017-10-27 21:18:56.314520"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

UPDATE "contacts" SET "content" = ?, "updated_at" = ? WHERE "contacts"."id" = ?
---
  def update
    if @contact.update(contact_params)

SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_contact
      @contact = Contact.first