app/controllers/manage/introduces_controller.rb

  def create
    @introduce = Introduce.new(introduce_params)
    if @introduce.save
---
INSERT INTO "introduces" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", ""], ["created_at", "2017-10-21 15:17:44.674924"], ["updated_at", "2017-10-21 15:17:44.674924"]]

  def update
    if @introduce.update(introduce_params)
---
UPDATE "introduces" SET "content" = ?, "updated_at" = ? WHERE "introduces"."id" = ?  [["content", "<img src=\"/assets/kindeditor/plugins/emoticons/images/9.gif\" alt=\"\" border=\"0\" />sss ddd<br />"], ["updated_at", "2017-10-21 20:11:19.057236"], ["id", 3]]

    def set_introduce
      @introduce = Introduce.first
---
SELECT  "introduces".* FROM "introduces" ORDER BY "introduces"."id" ASC LIMIT ?  [["LIMIT", 1]]