app/controllers/manage/medicines_controller.rb

  def create
    @medicine = Medicine.new(medicine_params)
    if @medicine.save
---
INSERT INTO "medicines" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "asdfasd"], ["created_at", "2017-11-11 22:27:08.432679"], ["updated_at", "2017-11-11 22:27:08.432679"]]

    def set_medicine
      @medicine = Medicine.first
---
SELECT  "medicines".* FROM "medicines" ORDER BY "medicines"."id" ASC LIMIT ?  [["LIMIT", 1]]