app/controllers/manage/news_controller.rb

  def create
    @news = News.new(news_params)
    if @news.save
---
INSERT INTO "news" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ww"], ["content", "wwww"], ["created_at", "2017-11-04 11:26:49.722534"], ["updated_at", "2017-11-04 11:26:49.722534"]]

  def edit
    @news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @news = News.find(params[:id])
    if @news.update(news_params)
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "news" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "news"."id" = ?  [["title", "asdf"], ["content", "1111asdfasdfsdasdfasd"], ["updated_at", "2017-11-11 22:14:18.459138"], ["id", 1]]

  def destroy
    @news = News.find(params[:id])
    @news.destroy
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 2]]