app/controllers/manage/products_controller.rb

INSERT INTO "products" ("title", "img", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "111"], ["img", "#<ActionDispatch::Http::UploadedFile:0x007f69c203c838>"], ["content", "111"], ["created_at", "2017-11-11 13:53:55.789863"], ["updated_at", "2017-11-11 13:53:55.789863"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "products" SET "title" = ?, "img" = ?, "content" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "黄芪"], ["img", "4a9757c5aea65858d8907d5542240c46.png"], ["content", "黄芪片"], ["updated_at", "2017-12-17 10:19:41.791460"], ["id", 3]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)