app/controllers/manage/tours_controller.rb

  def create
    @tour = Tour.new(tour_params)
    if @tour.save
---
INSERT INTO "tours" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "sdfasdf"], ["created_at", "2017-11-11 22:27:00.711115"], ["updated_at", "2017-11-11 22:27:00.711115"]]

    def set_tour
      @tour = Tour.first
---
SELECT  "tours".* FROM "tours" ORDER BY "tours"."id" ASC LIMIT ?  [["LIMIT", 1]]