app/controllers/manage/valleys_controller.rb

  def create
    @valley = Valley.new(valley_params)
    if @valley.save
---
INSERT INTO "valleys" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "ff"], ["created_at", "2017-10-29 16:32:48.567568"], ["updated_at", "2017-10-29 16:32:48.567568"]]

    def set_valley
      @valley = Valley.first
---
SELECT  "valleys".* FROM "valleys" ORDER BY "valleys"."id" ASC LIMIT ?  [["LIMIT", 1]]