app/controllers/kindeditor/assets_controller.rb

  def create
    @imgFile, @dir = params[:imgFile], params[:dir]
    unless @imgFile.nil?
      if Kindeditor::AssetUploader.save_upload_info? # save upload info into database
---
INSERT INTO "kindeditor_assets" ("asset", "file_size", "file_type", "owner_id", "owner_type", "asset_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)