app/controllers/address_controller.rb

  def index
    if Address.first
---
SELECT  "addresses".* FROM "addresses" ORDER BY "addresses"."id" ASC LIMIT ?  [["LIMIT", 1]]