app/controllers/brand_controller.rb

  def index
    if Brand.first
---
SELECT  "brands".* FROM "brands" ORDER BY "brands"."id" ASC LIMIT ?  [["LIMIT", 1]]