app/controllers/company_controller.rb

SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    if Company.first