app/controllers/contact_controller.rb

  def index
    if Contact.first
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT ?  [["LIMIT", 1]]