app/controllers/home_controller.rb

  def index
    @carsousels = Carsousel.order("no").all
---
SELECT "carsousels".* FROM "carsousels" ORDER BY no