app/controllers/introduce_controller.rb

  def index
    if Introduce.first
---
SELECT  "introduces".* FROM "introduces" ORDER BY "introduces"."id" ASC LIMIT ?  [["LIMIT", 1]]