app/controllers/medicine_controller.rb

SELECT  "medicines".* FROM "medicines" ORDER BY "medicines"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    if Medicine.first