app/controllers/news_controller.rb

SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @news = News.find(params[:id])