app/controllers/tour_controller.rb

SELECT  "tours".* FROM "tours" ORDER BY "tours"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    if Tour.first