app/controllers/valley_controller.rb

  def index
    if Valley.first
---
SELECT  "valleys".* FROM "valleys" ORDER BY "valleys"."id" ASC LIMIT ?  [["LIMIT", 1]]